//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
//                                                                            //
//                                                                            //
//                        //                       //                         //
//                        //  FRM - FOR REAL MAN   //                         //
//                        //                       //                         //
//                                                                            //
//                                                                            //
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
                           //  выводит строку s
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
void putsFRM (char *string) {

    while (*string != '\0')
    {
        putchar(*string);
        string++;
    }

    putchar('\n');

}
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
                 // нахождение длины смысловой части строки
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
int strlenFRM (char *string) {
    int n = 0;
    while (*string != '\0') {
        string++;
        n++;
    }
    return n;
}
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
  //  возвращает указатель типа char на первый символ c, находящийся в строке
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
char * strchrFRM (char *string, char symbol) {

    while (*string != symbol) {
        string++;
        if (*string == '\0') {
            return 0;
        }
    }
    return string;
}
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
            //  копирует всё содержимое одной строки в другую
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
char * strcpyFRM ( char *string0, char *string1) {

    while (*string1 != '\0') {
        *string0 = *string1;

        string0++;
        string1++;
    }
    *string0 = *string1;
    string0++;
    // лишнее
    while (*string0 != '\0') {
        *string0 = '\0';
        string0++;
    }

    return string0;
}
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
                       //  считывает строку из файла
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
char * fgetsFRM (char *string, int n, FILE *PtrFile) {
    //  функция читает строку с заданной длиной символов из указанного потока

    for (int i = 0; i < n - 1; i++) {
        *string = fgetc (PtrFile);
        if (*string == EOF) {
            return NULL;
        }
        if (*string++ == '\n') {
            break;
        }
        // string++;
    }

    //   считано до конца файла
    if (*string == EOF) {
        return NULL;
    }

    //   считано успешно

    *string = '\0';

    return string;

}


// fgetc - функция, которая считывает данные типа unsigned char в потоке, причем
// автономно продвигается дальше по файлу

//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
            // вставляет содержимое первой строки во вторую строку
                  // без изменения содержимого второй строки
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
char * strcatFRM (char *string, const char *string1) {
    char * p = string;
    while (*string != '\0') {
        string++;
    }
    // *string = ' ';
    // string++;
    while (*string1 != '\0') {
        *string = *string1;
        string1++;
        string++;
    }
    *string = '\0';

    return p;
}
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//

//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
void strncatFRM (char *string, char *string1, int n) {

    while (*string != '\0') {
        string++;
    }

    char c = *(string1 + n);

    while (*string1 != c) {
        *string = *string1;
        string++;
        string1++;
    }

    *string = '\0';
}
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
  //   делает копию строки s, адресует содержимое и возвращает этот адрес //
char * strdupFRM (char *s) {
    char * p;
    // p = (char *) malloc( strlenFRM(s) + 1);

    p = calloc (strlenFRM (s), sizeof (char));

    if (p != NULL) { // NULL выводится в любом из случаев
        strcpyFRM (p, s);
    }

    return p;
}
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
//===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*//
